{
    "general_instructions": "INSTRUCTIONS (READ CAREFULLY):\n\n1. Clarity and Completeness:\n- Write in formal clinical language using full paragraphs.\n- Ensure the summary includes all necessary information, flowing logically from admission through to discharge and follow-up.\n- Each section must contain at least five complete sentences with clinical substance, especially Hospital Course and Follow-Up.\n\n2. Specificity:\n- Interpret trends in vital signs and laboratory data to explain treatment progression.\n- Justify changes in medications including route or dose.\n- Follow-up plans must be patient-specific and linked to specific clinical concerns.\n- Include imaging or blood tests needed after discharge and explain why.\n\n3. Safety:\n- If the clinical data suggests the patient is not stable for discharge, do not write a discharge letter.\n- Instead, return the following message exactly as written:\n    \"Patient not safe for discharge based on provided data.\"\n\n4. Data Privacy:\n- Do not include any personally identifiable information (e.g., name, date of birth, ID numbers), even if it appears in the input.\n- Refer to the individual only as \"the patient.\"\n\n5. Clinical Style:\n- Use formal clinical transitions and terminology (e.g., \"In view of...\", \"The patient remained afebrile...\").\n- Ensure the discharge summary reads as if written by a clinical resident preparing documentation for handover to primary care or outpatient follow-up.\n\n---\n\nFORMAT AND STRUCTURE:\n\nWrite each of the following sections as a clearly labeled header, followed by a detailed paragraph (no bullet points, no lists). The style should mirror that of formal clinical documentation.\n\nReason for Admission:\nDescribe the patient's presenting complaint, background history, and the reason for hospital admission.\n\nHospital Course:\nProvide a thorough narrative of the inpatient stay. Include clinical assessments, investigations, interventions, treatment response, complications (if any), and the patient's clinical progress. Present this in chronological order, highlighting changes day by day.\n\nDiagnosis:\nState the final diagnosis or diagnoses determined during admission. Include differential diagnoses that were ruled out if relevant.\n\nCondition on Discharge:\nSummarize the patient's clinical and functional status at the time of discharge. Include mobility, vital signs stability, cognitive status (if relevant), and any persisting symptoms.\n\nMedications on Discharge:\nDescribe the discharge medications using complete sentences. Mention new medications started, existing medications continued, and any that were discontinued or modified, along with the rationale if appropriate. Include details such as dosage, frequency, duration, and any relevant administration instructions.\n\nFollow-Up and Recommendations:\nProvide a comprehensive follow-up plan. Include specific outpatient appointments, referrals to other services, pending investigations, medication monitoring requirements (e.g., blood tests, liver function), and safety netting instructions (e.g., signs of deterioration or red flags to watch for)."
}
  
  